Examinator/src/Documents/СертификатСУО/СертификатСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СертификатСУО</name>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаЧтоВыдан</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Аннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСертификатовСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/АвтоматическиеПравилаВыдачиСертификатовСУО/АвтоматическиеПравилаВыдачиСертификатовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоматическиеПравилаВыдачиСертификатовСУО</name>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСертификатовСУО</types>
    </type>
  </resources>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборПользователей</name>
    <type>
      <types>CatalogRef.ОтборыПользователейСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыПрохожденияОбъектовСУО/СтатусыПрохожденияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПрохожденияОбъектовСУО</name>
  <enumValues>
    <name>Зачислен</name>
  </enumValues>
  <enumValues>
    <name>Проходит</name>
  </enumValues>
  <enumValues>
    <name>Завершил</name>
  </enumValues>
  <enumValues>
    <name>НеЗавершил</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Автомат</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПеременныеШаблонаСертификатаСУО/ПеременныеШаблонаСертификатаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПеременныеШаблонаСертификатаСУО</name>
  <enumValues>
    <name>ЗаЧтоВыдан</name>
  </enumValues>
  <enumValues>
    <name>КогдаВыдан</name>
  </enumValues>
  <enumValues>
    <name>КомуВыдан</name>
  </enumValues>
  <enumValues>
    <name>Номер</name>
  </enumValues>
  <enumValues>
    <name>ДействуетДо</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ШаблоныСертификатовСУО/ШаблоныСертификатовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСертификатовСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличныйМакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/СертификатСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ОБЩЕЕ

Функция ВыдатьСертификат(ПрохождениеОбучения, НеОбновлятьДанныеВебКабинета = Неопределено, ПрохождениеОбученияСвойства = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Задаем переменные
	
	АвтоОснование = Неопределено;
	КомуВыдан = Неопределено;
	МожноВыдать = Истина;	
	
	// Получаем массив всех возможных оснований (порядок важен)
	
	МассивОснований = Новый Массив;
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		
		Если ПрохождениеОбученияСвойства = Неопределено Тогда
			ПрохождениеОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеОбучения, Пользователь");
		КонецЕсли;
		
		СтатусОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
		
		Если СтатусОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
			И СтатусОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
			МожноВыдать = Ложь;
		КонецЕсли;
		
		КомуВыдан = ПрохождениеОбученияСвойства.Пользователь; 
		
		Если ЗначениеЗаполнено(ПрохождениеОбученияСвойства.Сценарий) Тогда
			Сценарий = ПрохождениеОбученияСвойства.Сценарий;
		Иначе
			Сценарий = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ПрохождениеОбучения);
		КонецЕсли;
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПрохождениеОбученияСвойства.ПроведениеОбучения, Сценарий);
		
		МассивОснований.Добавить(ВидОбучения);
		МассивОснований.Добавить(Сценарий);
		МассивОснований.Добавить(ПрохождениеОбученияСвойства.ПроведениеОбучения);
		
	КонецЕсли;
	
	Если ТипЗнч(ПрохождениеОбучения) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		
		ПрохождениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "Сценарий, ПроведениеПрограммыОбучения, Пользователь, Статус");
		
		Если ПрохождениеПрограммыОбученияСвойства.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил
			И ПрохождениеПрограммыОбученияСвойства.Статус <> Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат Тогда
			МожноВыдать = Ложь;
		КонецЕсли;
		
		КомуВыдан = ПрохождениеПрограммыОбученияСвойства.Пользователь; 
		
		Если ЗначениеЗаполнено(ПрохождениеПрограммыОбученияСвойства.Сценарий) Тогда
			МассивОснований.Добавить(ПрохождениеПрограммыОбученияСвойства.Сценарий);
		КонецЕсли;
		
		МассивОснований.Добавить(ПрохождениеПрограммыОбученияСвойства.ПроведениеПрограммыОбучения);
		
	КонецЕсли;
	
	Если НЕ МожноВыдать Тогда
		Возврат Неопределено; // Нельзя еще выдавать
	КонецЕсли;	
	
	// Получаем все правила для всех оснований
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Основание КАК Основание,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.ОтборПользователей,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Шаблон,
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.СрокДействия
		|ИЗ
		|	РегистрСведений.АвтоматическиеПравилаВыдачиСертификатовСУО КАК АвтоматическиеПравилаВыдачиСертификатовСУО
		|ГДЕ
		|	АвтоматическиеПравилаВыдачиСертификатовСУО.Основание В(&МассивОснований)";
	
	Запрос.УстановитьПараметр("МассивОснований", МассивОснований);
	
	РезультатЗапросаПравилВыдачи = Запрос.Выполнить();
	
	Если РезультатЗапросаПравилВыдачи.Пустой() Тогда
		Возврат Неопределено; // Нет правил
	КонецЕсли;		
	
	ВыборкаПравилВыдачи = РезультатЗапросаПравилВыдачи.Выбрать();
	
	Для каждого Основание Из МассивОснований Цикл
	
		ВыборкаПравилВыдачи.Сбросить();
		
		Пока ВыборкаПравилВыдачи.НайтиСледующий(Основание, "Основание") Цикл			
			АвтоОснование = Новый Структура("Ссылка, Шаблон, Отбор, СрокДействия", ВыборкаПравилВыдачи.Основание, ВыборкаПравилВыдачи.Шаблон, ВыборкаПравилВыдачи.ОтборПользователей, ВыборкаПравилВыдачи.СрокДействия);
			Прервать;
		КонецЦикла;
	
	КонецЦикла;
	
	// Создаем сертификат
	
	СозданныйСертификат = Неопределено;
	
	Если АвтоОснование <> Неопределено
		И КомуВыдан <> Неопределено Тогда
		
		МожноВыдать = (НЕ ЗначениеЗаполнено(АвтоОснование.Отбор)
			ИЛИ Справочники.ОтборыПользователейСУО.ПользовательВходитВОтбор(АвтоОснование.Отбор, КомуВыдан));

		Если МожноВыдать Тогда			
			СозданныйСертификат = СоздатьСертификат(КомуВыдан, АвтоОснование.Ссылка, ПрохождениеОбучения, АвтоОснование.Шаблон, АвтоОснование.СрокДействия, НеОбновлятьДанныеВебКабинета);
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат СозданныйСертификат; 
	
КонецФункции

Функция ПредставлениеHTML(Знач Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстМакета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.Шаблон, "Текст");
	
	Возврат ПредставлениеМакета(Сертификат, ТекстМакета);
	
КонецФункции

Функция ПредставлениеPDF(Знач Сертификат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ТабличныйМакет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.Шаблон, "ТабличныйМакет").Получить();
	
	ТабличныйМакет = ПредставлениеМакета(Сертификат, ТабличныйМакет);
	
	ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла(".pdf");
	ТабличныйМакет.Записать(ПутьКВременномуФайлу, ТипФайлаТабличногоДокумента.PDF);
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПутьКВременномуФайлу);
	
	Попытка
		УдалитьФайлы(ПутьКВременномуФайлу);
	Исключение
	КонецПопытки;
	
	Возврат ДвоичныеДанныеФайла;
	
КонецФункции

Функция ПредставлениеМакета(Знач Сертификат, Макет)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Простые переменные
	
	Для каждого Переменная Из Перечисления.ПеременныеШаблонаСертификатаСУО Цикл
	
		ИмяПеременной = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Переменная);
		
		ЗначениеПеременной = "";
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.ЗаЧтоВыдан Тогда			
			ЗначениеПеременной = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.ЗаЧтоВыдан, "Наименование");
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.КогдаВыдан Тогда
			ЗначениеПеременной = Формат(Сертификат.Дата, "ДЛФ=DD");
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.КомуВыдан Тогда
			ЗначениеПеременной = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.КомуВыдан, "Наименование");
		КонецЕсли;		
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.Номер Тогда
			ЗначениеПеременной = Строка(Сертификат.Номер);
		КонецЕсли;
		
		Если Переменная = Перечисления.ПеременныеШаблонаСертификатаСУО.ДействуетДо Тогда
			Если ЗначениеЗаполнено(Сертификат.ДействуетДо) Тогда
				ЗначениеПеременной = Формат(Сертификат.ДействуетДо, "ДЛФ=DD");
			Иначе
				ЗначениеПеременной = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Макет) = Тип("Строка") Тогда
			Макет = СтрЗаменить(Макет, "{{"+ИмяПеременной+"}}", ЗначениеПеременной);
		Иначе
			ЗаменитьПеременныеВТабличномМакете(Макет, ИмяПеременной, ЗначениеПеременной)
		КонецЕсли;
	
	КонецЦикла;	
	
	// Дополнительные переменные
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСертификатовСУОДополнительныеПеременные.Переменная,
		|	ШаблоныСертификатовСУОДополнительныеПеременные.ИмяПеременной
		|ИЗ
		|	Справочник.ШаблоныСертификатовСУО.ДополнительныеПеременные КАК ШаблоныСертификатовСУОДополнительныеПеременные
		|ГДЕ
		|	ШаблоныСертификатовСУОДополнительныеПеременные.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Сертификат.Шаблон);
	
	ТаблицаПеременных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗначенийДопПеременных = УправлениеОбучениемСУО.ТаблицаЗначенийДополнительныхПеременных(ТаблицаПеременных, Сертификат.КомуВыдан);
	
	Для каждого СтрокаТЗ Из ТаблицаЗначенийДопПеременных Цикл
	
		Если ТипЗнч(Макет) = Тип("Строка") Тогда
			Макет = СтрЗаменить(Макет, "{{"+СтрокаТЗ.ИмяПеременной+"}}", СтрокаТЗ.Значение);
		Иначе
			ЗаменитьПеременныеВТабличномМакете(Макет, СтрокаТЗ.ИмяПеременной, СтрокаТЗ.Значение)
		КонецЕсли;			
	
	КонецЦикла;
	
	Возврат Макет;
	
КонецФункции

Функция ЗаменитьПеременныеВТабличномМакете(ТабличныйМакет, ИмяПеременной, ЗначениеПеременной)
	
	Для каждого РисунокТД Из ТабличныйМакет.Рисунки Цикл
	
		Если РисунокТД.ТипРисунка = ТипРисункаТабличногоДокумента.Текст Тогда
			РисунокТД.Текст = СтрЗаменить(РисунокТД.Текст, "{{"+ИмяПеременной+"}}", ЗначениеПеременной);
		КонецЕсли;
	
	КонецЦикла;
	
КонецФункции

Функция СоздатьСертификат(КомуВыдан, Основание, ПрохождениеОбучения, Шаблон, СрокДействия, НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Ищем, не создан ли уже сертификат		
	
	СуществующийСертификат = НайтиСертификат(ПрохождениеОбучения, Ложь);
	
	Если ЗначениеЗаполнено(СуществующийСертификат) Тогда
		Возврат СуществующийСертификат; // Уже создан
	КонецЕсли;	
	
	СертификатОбъект = Документы.СертификатСУО.СоздатьДокумент();
		
	СертификатОбъект.Дата = ТекущаяДатаСеанса();
	СертификатОбъект.КомуВыдан = КомуВыдан;
	СертификатОбъект.Основание = Основание;
	СертификатОбъект.ПрохождениеОбучения = ПрохождениеОбучения;
	СертификатОбъект.Шаблон = Шаблон;
	СертификатОбъект.ЗаЧтоВыдан = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПрохождениеОбучения).СценарийОбучения(ПрохождениеОбучения);
	
	Если СрокДействия > 0 Тогда
		СертификатОбъект.ДействуетДо = КонецДня(ДобавитьМесяц(СертификатОбъект.Дата, СрокДействия));
	КонецЕсли;
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		СертификатОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;
	
	СертификатОбъект.Записать(РежимЗаписиДокумента.Проведение);

	Возврат СертификатОбъект.Ссылка;
	
КонецФункции

Функция НайтиСертификат(ПрохождениеОбучения, ТолькоАктуальные = Истина) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатСУО.Ссылка
		|ИЗ
		|	Документ.СертификатСУО КАК СертификатСУО
		|ГДЕ
		|	СертификатСУО.ПрохождениеОбучения = &ПрохождениеОбучения";
		
	Если НЕ ТолькоАктуальные Тогда
		Запрос.Текст = Запрос.Текст + " И СертификатСУО.Проведен = Истина И СертификатСУО.Аннулирован = Ложь И СертификатСУО.Отменен = Ложь";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;	
	
КонецФункции

Функция СертификатАктивен(Знач Сертификат) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат, "Проведен, Аннулирован, Отменен");
	Возврат (ДанныеСертификата.Проведен И НЕ ДанныеСертификата.Аннулирован И НЕ ДанныеСертификата.Отменен);
КонецФункции

Функция ДанныеСертификатаДляСкачивания(Знач Сертификат, УникальныйИдентификаторФормы = Неопределено) Экспорт
	ДанныеСертификата = Новый Структура("ИмяФайла, АдресХранения");		
	ДвоичныеДанныеСертификата = ПредставлениеPDF(Сертификат);
	ДанныеСертификата.АдресХранения = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификаторФормы);
	ДанныеСертификата.ИмяФайла = ИмяФайлаСертификата(Сертификат);
	Возврат ДанныеСертификата;
КонецФункции

Функция ИмяФайлаСертификата(Знач Сертификат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТребуемыеДанныеСертификата = Новый Структура("КомуВыдан, ЗаЧтоВыдан", "КомуВыдан.Наименование", "ЗаЧтоВыдан.Наименование");
	ДанныеСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат, ТребуемыеДанныеСертификата);
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ДанныеСертификата.КомуВыдан);
	ИмяФайла = ИмяФайла + " - ";
	ИмяФайла = ИмяФайла + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ДанныеСертификата.ЗаЧтоВыдан);
	
	Возврат ИмяФайла + ".pdf";
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(Сертификат, ДополнительныеДанные = Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Удаляем старые данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Сертификат);

	// Добавляем новые данные
	
	Если СертификатАктивен(Сертификат) Тогда
		
		Выполнить(Строка("Лиц"+"ензи"+"рованиеВеб"+"КабинетаСУ.Прове"+"ритьРег"+"истрац"+"ионныеНом"+"ера();"));
		
		// Данные сертификата
		
		ДанныеСертификата = СертификатJSON(Сертификат);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Сертификат.КомуВыдан, Перечисления.ТипыДанныхВебКабинетаСУО.Сертификат, Сертификат, ДанныеСертификата, Перечисления.ФорматыВебДанныхСУ.json); 
		
		// Зависимости
		
		Зависимости = Новый Массив;		
		Зависимости.Добавить(Сертификат.ЗаЧтоВыдан);
		Зависимости.Добавить(Сертификат.Шаблон);
		Зависимости.Добавить(Сертификат.КомуВыдан);
			
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Сертификат, "Документ.СертификатСУО", Зависимости);		
		
	КонецЕсли;	
	
	// Обновляем данные прохождения
	
	ОбщегоНазначения.МенеджерОбъектаПоСсылке(Сертификат.ПрохождениеОбучения).ОбновитьДанныеВебКабинета(Сертификат.ПрохождениеОбучения);
		
КонецПроцедуры

Функция СертификатJSON(Сертификат) Экспорт
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(СертификатСтруктура(Сертификат));	
	
КонецФункции

Функция СертификатСтруктура(Сертификат) Экспорт
	
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сертификат.Шаблон, "ФорматHTML, ФорматPDF");	
	
	СтруктураСертификата = Новый Структура();
	СтруктураСертификата.Вставить("Идентификатор", Строка(Сертификат.УникальныйИдентификатор()));
	СтруктураСертификата.Вставить("КогдаВыдан", Сертификат.Дата);
	СтруктураСертификата.Вставить("ЗаЧтоВыдан", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат.ЗаЧтоВыдан, "Наименование"));
	СтруктураСертификата.Вставить("ФорматHTML", ДанныеШаблона.ФорматHTML);
	СтруктураСертификата.Вставить("ФорматPDF", ДанныеШаблона.ФорматPDF);
	
	Возврат СтруктураСертификата;
	
КонецФункции

Функция АдресВВебКабинете(Знач Сертификат, Знач ЕстьФорматHTML = Неопределено, ПричинаОшибкиПолученияАдресаСертификата = Неопределено) Экспорт
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Веб-кабинет не подключен'");
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сертификат) Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Сертификат не найден'");
		Возврат Неопределено;		
	КонецЕсли;
	
	Если ЕстьФорматHTML = Неопределено Тогда
		ЕстьФорматHTML = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат, "Шаблон.ФорматHTML");
	КонецЕсли;
	
	Если НЕ ЕстьФорматHTML Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Шаблон сертификата не имеет формата HTML'");
		Возврат Неопределено;
	КонецЕсли;
	
	АдресВебКабинета = Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета();
	Если НЕ ЗначениеЗаполнено(АдресВебКабинета) Тогда
		ПричинаОшибкиПолученияАдресаСертификата = НСтр("ru = 'Адрес веб-кабинета не определен'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АдресВебКабинета + "/certificate.html?certificate=" + Строка(Сертификат.УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("КомуВыдан");
	Поля.Добавить("ЗаЧтоВыдан");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ЗаЧтоВыдан, "Наименование");
	Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.КомуВыдан, "Наименование");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 / %2 / %3'"), Наименование, Пользователь, Формат(Данные.Дата, "ДЛФ=D"));
КонецПроцедуры

#КонецОбласти


#КонецЕсли
